# Session 1-- Introduction to Python

# Module 2--Manipulating data


- Module 1 covers python basics
    - Notes (Current page)
    - Video

- Module 2 covers downloading
    - Notes
    - Video

# Review

## R.1 Data types
### R.1.1 Strings

In [1]:
my_str = 'My string'
print(my_str)

My string

### R.1.2 Integers/Float

In [14]:
my_num = 100.8
type(my_num)

float

### R.1.3 Lists

- Lists can be made up of strings or numbers
- Spacing is not necessarily important!

In [15]:
my_list = ['Python', 'R', 'Stata', 'Excel']
my_list

['Python', 'R', 'Stata', 'Excel']

### R.1.3.1 Select range of elements

In [16]:
# This selects the zeroth, and first elements BUT NOT THE 2nd element
my_list[0:2]

['Python', 'R']

### R.1.4 Dictionary

- This is new material

In [101]:
my_dictionary = {'pop':'POPULATION!', # Left side are 'keys', right side are "values"
                 'year':'date'}

### Values

In [102]:
my_dictionary.values()

dict_values(['POPULATION!', 'date'])

### Keys

In [104]:
my_dictionary.keys()

dict_keys(['pop', 'year'])

## R.2. Pandas

In [17]:
import pandas as pd

### R.2.1 Import data
- pd.read_stata
- pd.read_csv
- pd.read_excel

In [28]:
url = 'https://www.macrohistory.net/app/download/9834512569/JSTdatasetR5.xlsx?t=1641215586'
df = pd.read_excel(url, sheet_name=1)
df.head(2)

,year,country,iso,ifs,pop,rgdpmad,rgdppc,rconpc,gdp,iy,...,eq_capgain,eq_dp,eq_capgain_interp,eq_tr_interp,eq_dp_interp,bond_rate,eq_div_rtn,capital_tr,risky_tr,safe_tr
0,1870,Australia,AUS,193,1775.0,3273.239437,13.836157,21.449734,208.78,0.109266,...,-0.070045,0.071417,NaN,NaN,NaN,0.049118,0.066415,NaN,NaN,NaN
1,1871,Australia,AUS,193,1675.0,3298.507463,13.936864,19.930801,211.56,0.104579,...,0.041654,0.065466,NaN,NaN,NaN,0.048446,0.068193,NaN,NaN,NaN

### R.2.2 Basic pandas functions

In [29]:
# Show first x rows
#df.head(2)
# Show last x rows
#df.tail(2)
# Descriptive statistics
#df.describe()[:3]
# Show columns
#df.columns

### R.2.3 Select column

In [30]:
df[['country']].head(2)

     country
0  Australia
1  Australia

In [36]:
df.country.head(2)

0    Australia
1    Australia
Name: country, dtype: object

## R.3 loc function

- This is something we did not cover in session 1

In [41]:
df.loc[:, :].head(2) #Left side: row Right side: column

,year,country,iso,ifs,pop,rgdpmad,rgdppc,rconpc,gdp,iy,...,eq_capgain,eq_dp,eq_capgain_interp,eq_tr_interp,eq_dp_interp,bond_rate,eq_div_rtn,capital_tr,risky_tr,safe_tr
0,1870,Australia,AUS,193,1775.0,3273.239437,13.836157,21.449734,208.78,0.109266,...,-0.070045,0.071417,NaN,NaN,NaN,0.049118,0.066415,NaN,NaN,NaN
1,1871,Australia,AUS,193,1675.0,3298.507463,13.936864,19.930801,211.56,0.104579,...,0.041654,0.065466,NaN,NaN,NaN,0.048446,0.068193,NaN,NaN,NaN

In [43]:
df.loc[:, # This is the row selection 
       ['country'] # This is the column selection
      ].head(2) #

     country
0  Australia
1  Australia

In [31]:
df.loc[:, ['pop']].head(3)

      pop
0  1775.0
1  1675.0
2  1722.0

# 1. Subset data

## 1.1 Subset columns
- Note we covered this last week




###  Visualize: Column subset
<img src="Screenshots/subset_col.png" width=500 length=500 />

### 1.1.1 Show data

In [39]:
df.columns[:10]

Index(['year', 'country', 'iso', 'ifs', 'pop', 'rgdpmad', 'rgdppc', 'rconpc',
       'gdp', 'iy'],
      dtype='object')

In [40]:
df.head(2)

,year,country,iso,ifs,pop,rgdpmad,rgdppc,rconpc,gdp,iy,...,eq_capgain,eq_dp,eq_capgain_interp,eq_tr_interp,eq_dp_interp,bond_rate,eq_div_rtn,capital_tr,risky_tr,safe_tr
0,1870,Australia,AUS,193,1775.0,3273.239437,13.836157,21.449734,208.78,0.109266,...,-0.070045,0.071417,NaN,NaN,NaN,0.049118,0.066415,NaN,NaN,NaN
1,1871,Australia,AUS,193,1675.0,3298.507463,13.936864,19.930801,211.56,0.104579,...,0.041654,0.065466,NaN,NaN,NaN,0.048446,0.068193,NaN,NaN,NaN

### 1.1.2 Subset

In [33]:
#Method 1
data = df.loc[:, ['year', 'country', 'pop', 'rgdpmad']]
#Method 2
data = df[['year', 'country', 'pop', 'rgdpmad']]
data.columns

Index(['year', 'country', 'pop', 'rgdpmad'], dtype='object')

In [34]:
data.head(2)

   year    country     pop      rgdpmad
0  1870  Australia  1775.0  3273.239437
1  1871  Australia  1675.0  3298.507463

## 1.2 Subset rows

### Visualize: row subset
<img src="Screenshots/subset_row.svg" width=500 length=500 />

### 1.2.1 Show unique country names

In [44]:
data.country.unique()

array(['Australia', 'Belgium', 'Canada', 'Switzerland', 'Germany',
       'Denmark', 'Spain', 'Finland', 'France', 'UK', 'Ireland', 'Italy',
       'Japan', 'Netherlands', 'Norway', 'Portugal', 'Sweden', 'USA'],
      dtype=object)

### 1.2.2 Subset data

#### 1.2.2.1 Step 1: Create mask

In [45]:
mask = data.country == 'Australia'
mask[:5]

0    True
1    True
2    True
3    True
4    True
Name: country, dtype: bool

#### 1.2.2.1 Step 2: Place mask in loc function

In [46]:
#METHOD 1
data[mask]

#Method 2
data.loc[mask, :].head(2)

   year    country     pop      rgdpmad
0  1870  Australia  1775.0  3273.239437
1  1871  Australia  1675.0  3298.507463

## 1.3 Subset rows: multiple conditions

### 1.3.1 Or condition
- The | symbol is an "or" condition
- The & symbol is an "and" condition

In [50]:
mask = (data.country ==  "Australia") | (data.country ==  "France")
data.loc[mask, : ].head(2)

   year    country     pop      rgdpmad
0  1870  Australia  1775.0  3273.239437
1  1871  Australia  1675.0  3298.507463

### 1.3.2 And condition

In [48]:
mask = (data.country ==  "Australia") & (data.country ==  "France")
df.loc[mask, : ].head(2)

Empty DataFrame
Columns: [year, country, iso, ifs, pop, rgdpmad, rgdppc, rconpc, gdp, iy, cpi, ca, imports, exports, narrowm, money, stir, ltrate, hpnom, debtgdp, revenue, expenditure, xrusd, tloans, tmort, thh, tbus, lev, ltd, noncore, crisisJST, crisisJST_old, peg, peg_strict, peg_type, peg_base, JSTtrilemmaIV, JSTtrilemmaIV_R, eq_tr, housing_tr, bond_tr, bill_rate, rent_ipolated, housing_capgain_ipolated, housing_capgain, housing_rent_rtn, housing_rent_yd, eq_capgain, eq_dp, eq_capgain_interp, eq_tr_interp, eq_dp_interp, bond_rate, eq_div_rtn, capital_tr, risky_tr, safe_tr]
Index: []

[0 rows x 57 columns]

In [56]:
mask = (data.country ==  "Australia") & (data.rgdpmad>3274)
data.loc[mask, : ].head(2)

   year    country     pop      rgdpmad
1  1871  Australia  1675.0  3298.507463
2  1872  Australia  1722.0  3553.426249

### 1.3.3 isin

In [58]:
country_list = ["France", "Spain"]
mask = data.country.isin(country_list) 
data.loc[mask, : ].head(2)

     year country           pop      rgdpmad
888  1870   Spain  16349.645454  1225.142151
889  1871   Spain  16389.546805  1319.392586

## 1.4 Combine column and row

In [62]:
mask = (data.country ==  "Japan") | (data.country ==  "France")

data.loc[mask, ['country','pop']].head(2)

     country      pop
1184  France  38440.0
1185  France  37731.0

# 2. Exploratory data analysis (EDA)

## 2.1 Value counts

In [63]:
df.head(2)

,year,country,iso,ifs,pop,rgdpmad,rgdppc,rconpc,gdp,iy,...,eq_capgain,eq_dp,eq_capgain_interp,eq_tr_interp,eq_dp_interp,bond_rate,eq_div_rtn,capital_tr,risky_tr,safe_tr
0,1870,Australia,AUS,193,1775.0,3273.239437,13.836157,21.449734,208.78,0.109266,...,-0.070045,0.071417,NaN,NaN,NaN,0.049118,0.066415,NaN,NaN,NaN
1,1871,Australia,AUS,193,1675.0,3298.507463,13.936864,19.930801,211.56,0.104579,...,0.041654,0.065466,NaN,NaN,NaN,0.048446,0.068193,NaN,NaN,NaN

In [64]:
df.iso.value_counts()

AUS    148
BEL    148
SWE    148
PRT    148
NOR    148
NLD    148
JPN    148
ITA    148
IRL    148
GBR    148
FRA    148
FIN    148
ESP    148
DNK    148
DEU    148
CHE    148
CAN    148
USA    148
Name: iso, dtype: int64

## 2.2 Unique

In [66]:
df.year.unique()[10:16] # 11th through the 16th element

array([1880, 1881, 1882, 1883, 1884, 1885])

In [70]:
subset = df.year.unique()[10:16]
mask = df.year.isin(subset)
df.loc[mask , :].tail(2)

,year,country,iso,ifs,pop,rgdpmad,rgdppc,rconpc,gdp,iy,...,eq_capgain,eq_dp,eq_capgain_interp,eq_tr_interp,eq_dp_interp,bond_rate,eq_div_rtn,capital_tr,risky_tr,safe_tr
2530,1884,USA,USA,111,55595.0,3320.280601,8.989438,12.4829,11.896,0.187627,...,-0.187266,0.071429,NaN,NaN,NaN,0.035283,0.058052,NaN,NaN,0.030949
2531,1885,USA,USA,111,56879.0,3269.959036,8.847994,12.5644,11.705,0.169655,...,0.198157,0.046154,NaN,NaN,NaN,0.033825,0.055300,NaN,NaN,0.045577

## 2.3 Pivot table

In [75]:
data.head(2)

   year    country     pop      rgdpmad
0  1870  Australia  1775.0  3273.239437
1  1871  Australia  1675.0  3298.507463

In [78]:
data_pop = data.pivot_table(index='year', columns='country', values='pop').head(2)
data_pop.head(2)

country,Australia,Belgium,Canada,Denmark,Finland,France,Germany,Ireland,Italy,Japan,Netherlands,Norway,Portugal,Spain,Sweden,Switzerland,UK,USA
year,,,,,,,,,,,,,,,,,,
1870,1775.0,5096.0,3781.0,1888.0,1768.769,38440.0,40804.0,NaN,27888.0,34437.0,3610.0,1735.0,4327.0,16349.645454,4164.0,2655.0,31400.0,40240.63
1871,1675.0,5137.0,3801.0,1903.0,1803.845,37731.0,40997.0,NaN,28063.0,34648.0,3636.0,1745.0,4353.0,16389.546805,4186.0,2680.0,31685.0,41098.00

## 2.4 Groupby

In [80]:
data.head(2)

   year    country     pop      rgdpmad
0  1870  Australia  1775.0  3273.239437
1  1871  Australia  1675.0  3298.507463

In [81]:
data.groupby('country')['pop'].last()

country
Australia       24233.955346
Belgium         11468.242804
Canada          36504.387391
Denmark          5758.157876
Finland          5513.130000
France          66617.845723
Germany         83979.282750
Ireland          4792.500000
Italy           59676.911500
Japan          126344.993014
Netherlands     17347.720625
Norway           5132.479116
Portugal        10436.449659
Spain           46549.045000
Sweden           9889.304235
Switzerland      8407.269643
UK              64774.053535
USA            324802.861426
Name: pop, dtype: float64

In [83]:
data.groupby('country')['rgdpmad'].mean()

country
Australia      10036.586764
Belgium         8962.777731
Canada          9686.763808
Denmark         9581.430422
Finland         7550.382341
France          8501.445365
Germany         8185.928174
Ireland        11306.247550
Italy           6982.784195
Japan           7184.341228
Netherlands     9335.977892
Norway          9112.792175
Portugal        4705.801741
Spain           6029.897161
Sweden          8978.576457
Switzerland    11868.856648
UK              9636.136570
USA            12316.327689
Name: rgdpmad, dtype: float64

# 3. Misc 

## 3.1 Rename columns

In [86]:
dictionary_name = {'country':'COUNTRY', 'pop':'POPULATION'}
type(dictionary_name)

dict

In [89]:
data.rename(columns = dictionary_name).head(2)

   year    COUNTRY  POPULATION      rgdpmad
0  1870  Australia      1775.0  3273.239437
1  1871  Australia      1675.0  3298.507463

## 3.2 Rename rows

In [94]:
map_names = {'Australia':'Aussieland', 
             'France':'Le Republique!!!!!!!!!'}

In [95]:
data.country.replace(map_names).unique()

array(['Aussieland', 'Belgium', 'Canada', 'Switzerland', 'Germany',
       'Denmark', 'Spain', 'Finland', 'Le Republique!!!!!!!!!', 'UK',
       'Ireland', 'Italy', 'Japan', 'Netherlands', 'Norway', 'Portugal',
       'Sweden', 'USA'], dtype=object)

## 3.3 Drop

In [90]:
drop_list = ['year', 'country']
data.drop(drop_list, axis=1).head(2)

      pop      rgdpmad
0  1775.0  3273.239437
1  1675.0  3298.507463